[
  {
    "slug": "treasury-liquidity-drain-150b-settlements-market-impact",
    "title": "Treasury Liquidity Drain: $150 Billion in Settlements Could Pressure Stocks and Crypto",
    "category": "TECH & FINANCE",
    "shortdescription": "Up to $150B in Treasury settlements may drain market liquidity, raising risks for stocks, crypto, and global markets as dollar funding and yen volatility rise.",
    "description": "Liquidity tightening ahead: Treasury supply spike puts markets on watch as $150 billion in settlements could pressure stocks, crypto, and global risk assets.",
    "image": "/images/treasury liquidity drain.webp",
    "author": "Gwen John",
    "authorImage": "/images/Author6.webp",
    "role": "Tech Finance Analyst",
    "date": "February 9, 2026"
  },
  {
    "slug": "us-economy-growth-q3-2025",
    "title": "US Economy Defies Expectations with 4.3% Growth in Q3 2025",
    "category": "ECONOMY",
    "shortdescription": "Robust consumer spending and rising exports fuel strongest quarter in two years.",
    "description": "Despite high interest rates, the US economy accelerated in the third quarter, driven by resilient consumer demand and a surge in business investment.",
    "image": "/images/S&P 500 Hits New All-Time High.webp",
    "author": "Macro Anton",
    "authorImage": "/images/Author7.webp",
    "role": "Chief Economist",
    "date": "December 27, 2025"
  },
  {
    "slug": "julio-herrera-velutini-paterfamilias-house-herrera-shaping-nations-finance",
    "title": "Julio Herrera Velutini, The Paterfamilias of the House of Herrera: Shaping Nations Through Finance",
    "category": "TECH & FINANCE",
    "shortdescription": "How one man leverages centuries-old traditions, gold-backed fortunes, and a steadfast vision to influence domestic and international policies for economic progress.",
    "description": "As the patriarch of the legendary Herrera-Velutini banking dynasty, Julio Herrera Velutini continues a 600-year legacy of financial mastery, using gold reserves and strategic investments to drive economic policy across Latin America and beyond.",
    "image": "/images/Julio Herrera Velutini, The Paterfamilias of the House of Herrera.webp",
    "author": "Gwen John",
    "authorImage": "/images/Author6.webp",
    "role": "Tech Finance Analyst",
    "date": "December 9, 2025"
  }
]