{
  "title": "China Unveils Aggressive Stimulus Package – Shifts to 'Moderately Loose' Monetary Policy",
  "category": "ECONOMY",
  "shortdescription": "Beijing adopts most accommodative policy stance in 14 years as growth concerns mount – pledges more fiscal spending.",
  "author": "Macro Anton",
  "authorImage": "/images/Author7.webp",
  "role": "Chief Economist",
  "date": "December 12, 2024",
  "readingTime": "9 min read",
  "content": [
    {
      "type": "image",
      "content": "/images/China $2 Trillion Stimulus 2025.webp"
    },
    {
      "type": "heading",
      "content": "Major Policy Pivot"
    },
    {
      "type": "paragraph",
      "content": "China's Politburo announced a historic shift to 'moderately loose' monetary policy in December 2024, the first time since 2010 that Beijing has abandoned its 'prudent' policy stance. The Central Economic Work Conference revealed plans for more proactive fiscal policy, increased government spending, and aggressive monetary easing to combat deflationary pressures and a deepening property crisis. According to <a href=\"https://www.pbc.gov.cn\" target=\"_blank\" rel=\"noopener noreferrer\">People's Bank of China</a> statements, the central bank will cut interest rates and reserve requirement ratios multiple times in 2025 while expanding credit availability. The announcement sent Chinese stocks soaring, with the CSI 300 index jumping 2.8% on the news. State media emphasized that policymakers would 'increase the intensity of unconventional counter-cyclical adjustments' to support growth, signaling potential measures beyond traditional monetary tools. The shift comes as China's GDP growth slows to 4.6% in Q3 2024, below the government's 5% target, with weak consumer spending and collapsing property values threatening broader economic stability."
    },
    {
      "type": "heading",
      "content": "Trillion-Dollar Support Expected"
    },
    {
      "type": "paragraph",
      "content": "Economists estimate China's new stimulus measures could inject over 2 trillion yuan ($280 billion) into the economy in 2025, with potential for much larger interventions if conditions worsen. As reported by <a href=\"https://www.bloomberg.com\" target=\"_blank\" rel=\"noopener noreferrer\">Bloomberg</a>, the government plans to issue 3 trillion yuan in special treasury bonds to fund infrastructure projects and support local governments struggling with debt. The property sector, which accounts for 25% of China's GDP, remains the primary concern with home prices down 5.8% year-over-year in November. Beijing has pledged to 'stop the decline' in real estate through easier lending standards, lower down payments, and direct government purchases of unsold inventory. The stimulus also targets consumption, with plans for expanded social welfare, higher pensions, and subsidies for automobile and appliance purchases. However, analysts warn that monetary easing alone may not revive growth without addressing deeper structural issues like weak consumer confidence, demographic decline, and rising geopolitical tensions that discourage foreign investment."
    }
  ]
}
