{
  "title": "Jeff Bezos Sells $10 Billion Amazon Stock in One Week – Biggest Insider Sale Ever",
  "category": "BILLIONAIRES",
  "shortdescription": "Bezos cashes out ahead of expected capital gains tax hike under new administration.",
  "author": "Wade Jenner",
  "authorImage": "/images/Author3.webp",
  "role": "Billionaire Analyst",
  "date": "November 20, 2025",
  "readingTime": "9 min read",
  "content": [
    {
      "type": "image",
      "content": "/images/Jeff Bezos Sells $10 Billion Amazon Stock 2025.webp"
    },
    {
      "type": "heading",
      "content": "The Largest Stock Sale in History"
    },
    {
      "type": "paragraph",
      "content": "Amazon founder Jeff Bezos has executed the largest insider stock sale in corporate history, selling 50 million shares worth $10.2 billion in just one week. The pre-planned 10b5-1 transaction, disclosed in SEC filings, represents 1.5% of Bezos's remaining Amazon holdings. The sale comes at a time when Amazon shares are trading near all-time highs following record Prime Day sales and strong AWS growth. Analysts speculate the timing is strategic, taking advantage of capital gains tax rates that may increase under the incoming administration."
    },
    {
      "type": "paragraph",
      "content": "The proceeds are expected to fund Bezos's ambitious space ventures through Blue Origin and his growing real estate portfolio. The billionaire has been acquiring prime coastal properties in Florida, Hawaii, and California, reportedly spending over $2 billion on waterfront estates in the past 18 months. Blue Origin's New Glenn rocket is scheduled for its first orbital launch in Q1 2026, with NASA contracts worth $3.4 billion already secured. Bezos's diversification strategy reflects a broader trend among tech founders who are increasingly moving away from single-stock concentration."
    },
    {
      "type": "heading",
      "content": "What This Means for Amazon"
    },
    {
      "type": "paragraph",
      "content": "Despite the massive sale, Bezos remains Amazon's largest individual shareholder with 9% ownership. The transaction had minimal impact on the stock price, which closed up 1.2% on the day of the filing. Amazon's performance has been stellar under CEO Andy Jassy, with the company achieving record operating margins and free cash flow generation. The e-commerce giant's AI investments are paying off, with Rufus the shopping assistant now powering 40% of product searches. Bezos's reduced stake actually signals confidence in the company's long-term trajectory, as he continues to benefit from Amazon's success through his substantial remaining position."
    }
  ]
}