{
  "title": "REITs Crash 35% in 2025: Is It Time to Buy the Dip?",
  "category": "INVESTING",
  "shortdescription": "Office and mall REITs hit decade lows — but data centers and industrial soaring.",
  "author": "Mark Blaze",
  "authorImage": "/images/Author4.webp",
  "role": "Value Investing Expert",
  "date": "November 19, 2025",
  "readingTime": "10 min read",
  "content": [
    {
      "type": "image",
      "content": "/images/reits.webp"
    },
    {
      "type": "heading",
      "content": "The Great REIT Divergence"
    },
    {
      "type": "paragraph",
      "content": "Real Estate Investment Trusts have experienced their worst year since 2008, with the VNQ ETF down 35% YTD. Office and retail REITs have been decimated by work-from-home trends and e-commerce growth, with many trading at 50–60% discounts to net asset value. However, this masks a dramatic divergence — data center and industrial REITs have hit all-time highs on AI infrastructure demand, while residential and healthcare REITs show steady performance."
    },
    {
      "type": "paragraph",
      "content": "The office sector faces existential challenges with vacancy rates at record highs and lease renewals down 60%. Mall REITs continue to struggle with department store closures. But industrial REITs like Prologis and data center operators like Digital Realty and Equinix are seeing unprecedented demand from cloud computing and AI training facilities. The spread between best and worst-performing REIT sectors is now at its widest ever recorded."
    },
    {
      "type": "heading",
      "content": "Opportunity or Value Trap?"
    },
    {
      "type": "paragraph",
      "content": "Value investors are beginning to circle, with many office REITs now yielding 8–10% and trading at deep discounts. However, analysts warn that many of these dividends may not be sustainable if occupancy continues to fall. The smart money appears to be focusing on specialized REITs — data centers, cell towers, and healthcare facilities — that benefit from secular growth trends rather than cyclical recovery hopes."
    }
  ]
}