{
  "title": "Saudi Vision 2030 Declared Success – Non-Oil Revenue Now 60% of GDP",
  "category": "ECONOMY",
  "shortdescription": "Kingdom reduces oil dependence dramatically – tourism and tech sectors explode.",
  "author": "Macro Anton",
  "authorImage": "/images/Author7.webp",
  "role": "Chief Economist",
  "date": "November 19, 2025",
  "readingTime": "9 min read",
  "content": [
    {
      "type": "image",
      "content": "/images/Saudi Vision 2030 Success 2025.webp"
    },
    {
      "type": "heading",
      "content": "The Post-Oil Era Begins"
    },
    {
      "type": "paragraph",
      "content": "Saudi Arabia has declared Vision 2030 an official success five years early, with non-oil revenue now accounting for 60% of GDP — up from just 10% in 2016. The kingdom's transformation from oil-dependent economy to diversified powerhouse has exceeded even the most optimistic projections. Tourism alone generated $80 billion in 2025, with 100 million visitors flocking to new destinations like NEOM, the Red Sea Project, and Riyadh Season, and AlUla."
    },
    {
      "type": "paragraph",
      "content": "The entertainment sector has been particularly explosive, with international concerts, sports events, and film productions bringing in billions while changing the kingdom's global image. Tech investments through the Public Investment Fund have created a startup ecosystem valued at $150 billion. The Riyadh stock exchange has become the largest in the Middle East, surpassing Dubai and Tel Aviv combined."
    },
    {
      "type": "heading",
      "content": "The Numbers Behind the Transformation"
    },
    {
      "type": "paragraph",
      "content": "Oil now represents only 40% of government revenue — down from 90% a decade ago. The kingdom's sovereign wealth fund has grown to $1.5 trillion, making it one of the world's largest investors in technology and entertainment. Women's workforce participation has doubled to 37%, adding millions to the economy. The combination of social reforms, massive infrastructure projects, and strategic investments has created a virtuous economic cycle that appears sustainable even if oil prices fall below $50."
    }
  ]
}