{
  "title": "Singapore Slaps 60% Property Tax on Foreign Buyers – Prices Still Rising",
  "category": "REAL ESTATE",
  "shortdescription": "World’s toughest cooling measures fail to stop luxury condo prices hitting $3,800/sqft.",
  "author": "Jonathan Gill",
  "authorImage": "/images/Author5.webp",
  "role": "Luxury Real Estate Analyst",
  "date": "November 19, 2025",
  "readingTime": "9 min read",
  "content": [
    {
      "type": "image",
      "content": "/images/singapore.webp"
    },
    {
      "type": "heading",
      "content": "The Unbreakable Singapore Market"
    },
    {
      "type": "paragraph",
      "content": "Singapore has implemented the world's most aggressive property cooling measures — increasing foreign buyer taxes to 60% — yet prime district condo prices continue climbing to $3,800 per square foot. The measures, introduced to curb speculation and protect local buyers, have paradoxically reinforced Singapore's status as the ultimate safe haven for global wealth. Ultra-high-net-worth individuals from China, Indonesia, and India continue purchasing properties despite the punitive taxes."
    },
    {
      "type": "paragraph",
      "content": "The government's strategy has backfired spectacularly. By making foreign ownership extremely expensive, they've created artificial scarcity in the prime market while simultaneously signaling Singapore's determination to remain a stable wealth preservation center. Domestic buyers, facing borrowing restrictions and high stamp duties, have largely stayed on the sidelines. This has left the luxury segment dominated by cash-rich international buyers who view the taxes as the cost of admission to the world's most stable real estate market."
    },
    {
      "type": "heading",
      "content": "The Psychology of Extreme Measures"
    },
    {
      "type": "paragraph",
      "content": "The 60% tax has become a status symbol. Owning Singapore property despite the world's highest barriers has become the ultimate flex for Asia's elite. Developers report that units subject to the foreign buyer tax actually sell faster and at higher premiums than those available to locals. The psychological effect has been to reinforce Singapore's position as the Switzerland of Asia — a place where the ultra-wealthy park their money regardless of cost. Prime district prices have risen 25% since the measures were introduced, proving that for true wealth preservation, location trumps all other considerations."
    }
  ]
}