{
    "title": "TMC MP’s Arrested During Protests Against ED’s I-PAC Raids",
    "category": "ECONOMY",
    "shortdescription": "TMC leaders, including MPs Mahua Moitra and Derek O’Brien, were arrested by Delhi police during a protest against ED raids on the I-PAC office in Kolkata.",
    "author": "Macro Anton",
    "authorImage": "/images/Author7.webp",
    "role": "Chief Economist",
    "date": "January 15, 2026",
    "readingTime": "12 min read",
    "content": [
        {
            "type": "image",
            "content": "/images/TMC-MPs-Arrested.webp"
        },
        {
            "type": "heading",
            "content": "Protests Erupt After ED Raids on I-PAC"
        },
        {
            "type": "paragraph",
            "content": "Numerous Trinamool Congress (TMC) leaders, including Members of Parliament Mahua Moitra and Derek O’Brien, were arrested by Delhi police on Friday while protesting outside the residence and office of Union Home Minister Amit Shah. The demonstration was organized in response to the Enforcement Directorate (ED) raids executed at the political consultancy business I-PAC’s office in Kolkata on Thursday. TMC MPs assembled with signs reading “Bengal rejects Modi-Shah’s corrupt politics,” emphasizing the opposition over the ED’s actions, which they described as politically motivated and intended to intimidate the party prior to the West Bengal Assembly elections."
        },
        {
            "type": "paragraph",
            "content": "During the protest, Mahua Moitra said to the media, “Yesterday, entire India, Bengal witnessed how ED was misused by the Home Ministry. The ED was sent to steal our party’s political, strategic information. Mamata Banerjee is a lioness, she protected our party’s properties.” TMC MP Kirti Azad added, “They are acting undemocratically; even the raid was illegal. They loot and accuse us of scams. They took away our strategy and candidate lists. BJP’s internal survey shows they won’t get more than 25 seats. But Mamata Banerjee will secure a massive mandate as CM and go on to become the Prime Minister.”"
        },
        {
            "type": "heading",
            "content": "ED Moves Calcutta High Court: Seeks CBI FIR against Banerjee"
        },
        {
            "type": "paragraph",
            "content": "The Enforcement Directorate (ED), in a plea before the Calcutta High Court, has requested an investigation by the Central Bureau of Investigation (CBI) into Chief Minister Mamata Banerjee. On Thursday, she entered the premises of the political consultancy firm Indian Pac Consulting Private Limited (I-PAC) and the residence of its co-founder, Pratik Jain, where the ED was conducting searches related to a money laundering case. Banerjee is reported to have removed several documents and electronic evidence from the premises associated with IPAC during the ED search on Thursday."
        },
        {
            "type": "paragraph",
            "content": "According to the ED, a coal smuggling syndicate headed by Anup Majee engaged in the theft and illegal excavation of coal from ECL leasehold areas in West Bengal, subsequently selling it to various factories and plants within the state. The investigation into Majee uncovered connections with Hawala operators, according to the ED. Among them, a hawala operator associated with the layering of proceeds from coal importation crimes is alleged to have facilitated transactions amounting to several tens of crores of rupees to I-PAC."
        },
        {
            "type": "heading",
            "content": "Mamata’s Allegations"
        },
        {
            "type": "paragraph",
            "content": "CM Banerjee reacted strongly to the raids, saying that the Centre was employing central agencies for political purposes before the polls. She said that an investigation was being used as an excuse to take party papers, hard drives, and private information. Banerjee asked, “Is it the duty of the ED, Amit Shah to collect the party’s hard disk, candidate list?... The nasty, naughty Home Minister who cannot protect the country and is taking away all my party documents. What will be the result if I raid the BJP party office?”"
        },
        {
            "type": "heading",
            "content": "Why This News Matters"
        },
        {
            "type": "paragraph",
            "content": "The arrest of TMC officials during a protest against the ED raids indicates how tense things are getting between the BJP and the TMC as the West Bengal polls grow closer. Mamata Banerjee and the TMC allege that the BJP government exploits agencies like the ED to go after people who are against them in politics. This makes some wonder how fair the upcoming elections will be. The situation indicates how far apart the two parties are before the key assembly elections in West Bengal."
        },
        {
            "type": "heading",
            "content": "What to Watch Next"
        },
        {
            "type": "paragraph",
            "content": "The Calcutta High Court's ruling on the ED's case against CM Banerjee and the TMC's petition against the ED is what you should watch next. Additionally, observers will be monitoring what the protests would mean for the approaching assembly elections in West Bengal."
        }
    ]
}