{
  "title": "US Core Inflation Rises to 3.3% in November – Services Inflation Remains Stubborn",
  "category": "ECONOMY",
  "shortdescription": "Core CPI accelerates for second straight month as shelter costs stay elevated – Fed's 2% target remains elusive.",
  "author": "Macro Anton",
  "authorImage": "/images/Author7.webp",
  "role": "Chief Economist",
  "date": "December 11, 2024",
  "readingTime": "9 min read",
  "content": [
    {
      "type": "image",
      "content": "/images/download1.webp"
    },
    {
      "type": "heading",
      "content": "Inflation Progress Stalls"
    },
    {
      "type": "paragraph",
      "content": "The US Bureau of Labor Statistics reported that core Consumer Price Index, which excludes volatile food and energy prices, rose 3.3% year-over-year in November 2024, up from 3.2% in October. The reacceleration marks a setback in the Federal Reserve's battle against inflation, with headline CPI coming in at 2.7%, also higher than the previous month. According to <a href=\"https://www.bls.gov\" target=\"_blank\" rel=\"noopener noreferrer\">BLS</a> data, shelter costs rose 0.3% month-over-month and account for nearly two-thirds of the overall increase, with owners' equivalent rent showing persistent stickiness. Services inflation excluding energy services climbed 4.7% annually, reflecting tight labor markets and wage growth of 4.0% that continues to fuel price pressures. The inflation report triggered a sharp selloff in bonds, with 10-year Treasury yields jumping 8 basis points to 4.3% as traders reduced expectations for aggressive Fed rate cuts in 2025. Food prices rose 2.4% year-over-year while energy costs fell 3.2%, but the divergence between goods deflation and services inflation complicates the Fed's policy path."
    },
    {
      "type": "heading",
      "content": "Shelter Inflation Refuses to Cool"
    },
    {
      "type": "paragraph",
      "content": "Housing costs remain the primary driver of persistent inflation, with shelter accounting for 40% of core CPI and showing no meaningful deceleration despite higher mortgage rates. As reported by <a href=\"https://www.zillow.com\" target=\"_blank\" rel=\"noopener noreferrer\">Zillow</a>, asking rents have fallen in real-time market data, but the lag in official CPI measurements means shelter inflation will likely remain elevated through mid-2025. Economists estimate that shelter CPI trails actual rental market conditions by 12-18 months due to the way BLS calculates housing costs using existing lease renewals rather than new market rates. Medical services inflation accelerated to 3.5%, while auto insurance costs surged 14% year-over-year, adding to household budget pressures. The stubborn inflation data supports the Fed's hawkish pivot announced at the December meeting, with Chair Powell citing the lack of progress on core services as justification for fewer rate cuts. Market-based inflation expectations remain anchored, with 5-year breakevens at 2.3%, but any further upside surprises could force the Fed to pause easing entirely or even consider rate hikes if inflation reaccelerates toward 4%."
    }
  ]
}
