[
  {
    "slug": "us-january-jobs-report-2026-130k-payrolls-unemployment-fed-outlook",
    "title": "January Jobs Report: Hiring Tops Expectations as Unemployment Falls to 4.3%",
    "category": "ECONOMY",
    "shortdescription": "The US added 130,000 jobs in January 2026, beating forecasts as unemployment fell to 4.3%. Strong headlines mask weak trends and heavy 2025 revisions.",
    "description": "US labor market surprises with 130K jobs, but 2025 revisions reveal weakness. Hiring tops expectations as unemployment falls to 4.3% while warning signs remain.",
    "image": "/images/US Adds.webp",
    "author": "Macro Anton",
    "authorImage": "/images/Author7.webp",
    "role": "Chief Economist",
    "date": "February 11, 2026"
  },
  {
    "slug": "americans-economic-outlook-2026-gallup-stock-market-inflation",
    "title": "Gallup Poll: U.S. Confidence in Markets Rebounds, Worries Over Prices and Employment Persist",
    "category": "ECONOMY",
    "shortdescription": "Americans expect stock market and economic growth to improve in 2026, but most still worry about rising inflation, unemployment, and household costs, Gallup finds.",
    "description": "Americans grow more optimistic on stocks and growth but fear inflation and job losses — new poll shows a divided nation bracing for higher prices and employment shifts in 2026.",
    "image": "/images/usaeconomy.webp",
    "author": "Macro Anton",
    "authorImage": "/images/Author7.webp",
    "role": "Chief Economist",
    "date": "February 10, 2026"
  },
  {
    "slug": "us-pushes-greenland-acquisition-national-security-missile-defense",
    "title": "Denmark Pushes Back on U.S. Greenland Acquisition Plans in Recent Talks",
    "category": "ECONOMY",
    "shortdescription": "Trump pushes for Greenland's control to strengthen U.S. national security, sparking a diplomatic conflict with Denmark and Greenland amid international opposition.",
    "description": "Denmark Foreign Minister Lars Løkke Rasmussen characterized the exchange as frank, stating, “There’s clearly a disagreement.",
    "image": "/images/US-Greenland-Talks.webp",
    "author": "Macro Anton",
    "authorImage": "/images/Author7.webp",
    "role": "Chief Economist",
    "date": "January 15, 2026"
  },
  {
    "slug": "hawaii-economic-decline-population-loss-high-costs",
    "title": "Hawaii Faces Economic Crisis: Rising Costs, Low Wages, and Declining Population",
    "category": "ECONOMY",
    "shortdescription": "Hawaii's population has steadily declined due to rising costs and stagnant wages.",
    "description": "New research highlights the state's growing economic challenges and the exodus of working families.",
    "image": "/images/hawaii.webp",
    "author": "Macro Anton",
    "authorImage": "/images/Author7.webp",
    "role": "Chief Economist",
    "date": "February 3, 2026"
  }
]